app/Controllers/crud_Controller.php

INSERT INTO `usuarios` (`nombre`, `apellido`, `usuario`, `email`, `password`) VALUES ('Yanina', 'Rodriguez', 'YaniRodri34', 'yaninarodriguezdev@gmail.com', '$2y$10$bFWLWQwYhMW2H83MjgguC.B/And2Nzim2duHQCA1n.ojgIYpLifYy')
---
  public function store()
  {
    $input = $this->validate([
      'nombre' => 'required|min_length[3]',
      'apellido' => 'required|min_length[3]|max_length[25]',
      'usuario' => 'required|min_length[3]|is_unique[usuarios.usuario]',
      'email' => 'required|min_length[4]|max_length[100]|valid_email|is_unique[usuarios.email]',
      'password' => 'required|min_length[6]|max_length[10]',
      'repassword' => 'required_with[password]|matches[password]'
    ]);

    $formModel = new usuario_Model();

    if (!$input) {
      $data['titulo'] = 'Create';
      echo view('front/head_view', $data);
      echo view('front/navbar_view');
      echo view('back/usuarios/create');
      echo view('front/footer_view');
    } else {
      $formModel->save([
        'nombre' => $this->request->getVar('nombre'),
        'apellido' => $this->request->getVar('apellido'),
        'usuario' => $this->request->getVar('usuario'),
        'email' => $this->request->getVar('email'),
        'password' => password_hash($this->request->getVar('password'), PASSWORD_DEFAULT),
      ]);

UPDATE `usuarios` SET `baja` = 'SI'
WHERE `usuarios`.`id_usuario` IN ('1')
---
  public function delete($id_usuario)
  {
    $model = new usuario_Model();

    // Verifica si el usuario existe
    if ($model->find($id_usuario)) {
      // Cambia el estado de baja a 'SI'
      $model->update($id_usuario, ['baja' => 'SI']);

UPDATE `usuarios` SET `baja` = 'NO'
WHERE `usuarios`.`id_usuario` IN ('1')
---
  public function activate($id_usuario)
  {
    $model = new usuario_Model();

    // Verifica si el usuario existe
    if ($model->find($id_usuario)) {
      // Cambia el estado de baja a 'NO'
      $model->update($id_usuario, ['baja' => 'NO']);