app/Models/usuario_Model.php

  public function getClients()
  {
    return $this->findAll();
---
SELECT *
FROM `usuarios`